#### Terraform Plan 📖
```module.api.data.archive_file.delete-function-zip: Reading...
module.alarm-trigger.data.archive_file.trigger-function-zip: Reading...
module.api.data.archive_file.create-function-zip: Reading...
module.layer.data.archive_file.layer_zip: Reading...
module.api.data.archive_file.update-function-zip: Reading...
module.api.data.archive_file.delete-function-zip: Read complete after 0s [id=1012d83b1cdbb66c25d8325819341f48a8cca17a]
module.api.data.archive_file.update-function-zip: Read complete after 0s [id=9046ada8f333d203d99daabe9317d14516f62e81]
module.api.data.archive_file.create-function-zip: Read complete after 0s [id=ede30d944c1defe12a7bb7db4f467f3250f78cf8]
module.alarm-trigger.data.archive_file.trigger-function-zip: Read complete after 0s [id=26020d5d9817e8ac4a323330a66e052733c5a88e]
module.api.data.aws_caller_identity.current: Reading...
module.alarm-trigger.data.aws_region.current: Reading...
module.api.data.aws_region.current: Reading...
module.alarm-trigger.data.aws_iam_policy_document.lambda_assume_role_policy: Reading...
module.api.data.aws_iam_policy_document.lambda_assume_role_policy: Reading...
module.api.data.aws_region.current: Read complete after 0s [id=ap-northeast-1]
module.alarm-trigger.data.aws_region.current: Read complete after 0s [id=ap-northeast-1]
module.api.data.aws_iam_policy_document.lambda_assume_role_policy: Read complete after 0s [id=2690255455]
module.alarm-trigger.data.aws_iam_policy_document.lambda_assume_role_policy: Read complete after 0s [id=2690255455]
module.api.data.aws_iam_policy_document.scheduler-assume-role-policy: Reading...
module.alarm-trigger.data.aws_caller_identity.current: Reading...
module.api.data.aws_iam_policy_document.scheduler-assume-role-policy: Read complete after 0s [id=52247394]
module.api.data.aws_caller_identity.current: Read complete after 0s [id=188970983837]
module.alarm-trigger.data.aws_caller_identity.current: Read complete after 0s [id=188970983837]
module.layer.data.archive_file.layer_zip: Read complete after 4s [id=a12bbc868caf084ca4000bf47b314fe0ed104074]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.alarm-trigger.aws_cloudwatch_log_group.throwtrash-alarm-trigger-log-group will be created
  + resource "aws_cloudwatch_log_group" "throwtrash-alarm-trigger-log-group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/throwtrash-alarm-trigger"
      + name_prefix       = (known after apply)
      + retention_in_days = 0
      + skip_destroy      = false
      + tags              = {
          + "app"   = "throwtrash"
          + "group" = "alarm"
        }
      + tags_all          = {
          + "app"   = "throwtrash"
          + "group" = "alarm"
        }
    }

  # module.alarm-trigger.aws_iam_policy.throwtrash-alarm-trigger-lambda-policy will be created
  + resource "aws_iam_policy" "throwtrash-alarm-trigger-lambda-policy" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "throwtrash-alarm-trigger-lambda-policy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags        = {
          + "app"   = "throwtrash"
          + "group" = "alarm"
        }
      + tags_all    = {
          + "app"   = "throwtrash"
          + "group" = "alarm"
        }
    }

  # module.alarm-trigger.aws_iam_role.throwtrash-alarm-trigger-lambda-role will be created
  + resource "aws_iam_role" "throwtrash-alarm-trigger-lambda-role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "throwtrash-alarm-trigger-lambda-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "app"   = "throwtrash"
          + "group" = "alarm"
        }
      + tags_all              = {
          + "app"   = "throwtrash"
          + "group" = "alarm"
        }
      + unique_id             = (known after apply)
    }

  # module.alarm-trigger.aws_iam_role_policy_attachment.lambda-policy-attachment will be created
  + resource "aws_iam_role_policy_attachment" "lambda-policy-attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "throwtrash-alarm-trigger-lambda-role"
    }

  # module.alarm-trigger.aws_lambda_alias.throwtrash-trigger-dev will be created
  + resource "aws_lambda_alias" "throwtrash-trigger-dev" {
      + arn              = (known after apply)
      + function_name    = "throwtrash-alarm-trigger"
      + function_version = "$LATEST"
      + id               = (known after apply)
      + invoke_arn       = (known after apply)
      + name             = "dev"
    }

  # module.alarm-trigger.aws_lambda_function.throwtrash-alarm-trigger-lambda will be created
  + resource "aws_lambda_function" "throwtrash-alarm-trigger-lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "alarm-trigger/alarm-trigger.zip"
      + function_name                  = "throwtrash-alarm-trigger"
      + handler                        = "index.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs20.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "GAUhNRz6cPtX+4j8u78gsBQibi+rm0tDHaCuyA6Qi0M="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "app"   = "throwtrash"
          + "group" = "alarm"
        }
      + tags_all                       = {
          + "app"   = "throwtrash"
          + "group" = "alarm"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "ALARM_TABLE_NAME"               = "throwtrash-alarm"
              + "GOOGLE_APPLICATION_CREDENTIALS" = "/var/task/firebase-config.json"
              + "TRASH_SCHEDULE_TABLE_NAME"      = "TrashSchedule"
            }
        }

      + logging_config {
          + log_format = "JSON"
          + log_group  = "/aws/lambda/throwtrash-alarm-trigger"
        }
    }

  # module.api.aws_api_gateway_api_key.api-key-dev will be created
  + resource "aws_api_gateway_api_key" "api-key-dev" {
      + arn               = (known after apply)
      + created_date      = (known after apply)
      + description       = "Managed by Terraform"
      + enabled           = true
      + id                = (known after apply)
      + last_updated_date = (known after apply)
      + name              = "throwtrash-alarm-dev-key"
      + tags_all          = (known after apply)
      + value             = (sensitive value)
    }

  # module.api.aws_api_gateway_deployment.api-deployment-dev will be created
  + resource "aws_api_gateway_deployment" "api-deployment-dev" {
      + created_date  = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = (known after apply)
      + triggers      = (known after apply)
    }

  # module.api.aws_api_gateway_integration.api-integration-create will be created
  + resource "aws_api_gateway_integration" "api-integration-create" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = "WHEN_NO_TEMPLATES"
      + resource_id             = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.api.aws_api_gateway_integration.api-integration-delete will be created
  + resource "aws_api_gateway_integration" "api-integration-delete" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "DELETE"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = "WHEN_NO_TEMPLATES"
      + resource_id             = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.api.aws_api_gateway_integration.api-integration-update will be created
  + resource "aws_api_gateway_integration" "api-integration-update" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "PUT"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = "WHEN_NO_TEMPLATES"
      + resource_id             = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.api.aws_api_gateway_method.api-method-delete will be created
  + resource "aws_api_gateway_method" "api-method-delete" {
      + api_key_required = true
      + authorization    = "NONE"
      + http_method      = "DELETE"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.api.aws_api_gateway_method.api-method-post will be created
  + resource "aws_api_gateway_method" "api-method-post" {
      + api_key_required = true
      + authorization    = "NONE"
      + http_method      = "POST"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.api.aws_api_gateway_method.api-method-put will be created
  + resource "aws_api_gateway_method" "api-method-put" {
      + api_key_required = true
      + authorization    = "NONE"
      + http_method      = "PUT"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.api.aws_api_gateway_resource.api-resource-create will be created
  + resource "aws_api_gateway_resource" "api-resource-create" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "create"
      + rest_api_id = (known after apply)
    }

  # module.api.aws_api_gateway_resource.api-resource-delete will be created
  + resource "aws_api_gateway_resource" "api-resource-delete" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "delete"
      + rest_api_id = (known after apply)
    }

  # module.api.aws_api_gateway_resource.api-resource-update will be created
  + resource "aws_api_gateway_resource" "api-resource-update" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "update"
      + rest_api_id = (known after apply)
    }

  # module.api.aws_api_gateway_rest_api.api will be created
  + resource "aws_api_gateway_rest_api" "api" {
      + api_key_source               = "HEADER"
      + arn                          = (known after apply)
      + binary_media_types           = (known after apply)
      + created_date                 = (known after apply)
      + description                  = (known after apply)
      + disable_execute_api_endpoint = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + minimum_compression_size     = (known after apply)
      + name                         = "throwtrash-alarm"
      + policy                       = (known after apply)
      + root_resource_id             = (known after apply)
      + tags                         = {
          + "app"   = "throwtrash"
          + "group" = "alarm"
        }
      + tags_all                     = {
          + "app"   = "throwtrash"
          + "group" = "alarm"
        }

      + endpoint_configuration {
          + types            = [
              + "REGIONAL",
            ]
          + vpc_endpoint_ids = (known after apply)
        }
    }

  # module.api.aws_api_gateway_stage.api-stage-dev will be created
  + resource "aws_api_gateway_stage" "api-stage-dev" {
      + arn           = (known after apply)
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = (known after apply)
      + stage_name    = "dev"
      + tags          = {
          + "app"   = "throwtrash"
          + "group" = "alarm"
        }
      + tags_all      = {
          + "app"   = "throwtrash"
          + "group" = "alarm"
        }
      + variables     = {
          + "stageName" = "dev"
        }
      + web_acl_arn   = (known after apply)
    }

  # module.api.aws_api_gateway_usage_plan.usage-plan-dev will be created
  + resource "aws_api_gateway_usage_plan" "usage-plan-dev" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "throwtrash-alarm-dev-plan"
      + tags_all = (known after apply)

      + api_stages {
          + api_id = (known after apply)
          + stage  = "dev"
        }
    }

  # module.api.aws_api_gateway_usage_plan_key.api-plan-key-dev will be created
  + resource "aws_api_gateway_usage_plan_key" "api-plan-key-dev" {
      + id            = (known after apply)
      + key_id        = (known after apply)
      + key_type      = "API_KEY"
      + name          = (known after apply)
      + usage_plan_id = (known after apply)
      + value         = (known after apply)
    }

  # module.api.aws_cloudwatch_log_group.throwtrash-alarm-log-group will be created
  + resource "aws_cloudwatch_log_group" "throwtrash-alarm-log-group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/throwtrash-alarm"
      + name_prefix       = (known after apply)
      + retention_in_days = 0
      + skip_destroy      = false
      + tags              = {
          + "app"   = "throwtrash"
          + "group" = "alarm"
        }
      + tags_all          = {
          + "app"   = "throwtrash"
          + "group" = "alarm"
        }
    }

  # module.api.aws_dynamodb_table.throwtrash-alarm-table will be created
  + resource "aws_dynamodb_table" "throwtrash-alarm-table" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "device_token"
      + id               = (known after apply)
      + name             = "throwtrash-alarm"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "app"   = "throwtrash"
          + "group" = "alarm"
        }
      + tags_all         = {
          + "app"   = "throwtrash"
          + "group" = "alarm"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "alarm_time"
          + type = "S"
        }
      + attribute {
          + name = "device_token"
          + type = "S"
        }

      + global_secondary_index {
          + hash_key           = "alarm_time"
          + name               = "alarm_time_index"
          + non_key_attributes = [
              + "device_token",
              + "platform",
              + "user_id",
            ]
          + projection_type    = "INCLUDE"
            # (1 unchanged attribute hidden)
        }
    }

  # module.api.aws_iam_policy.throwtrash-alarm-lambda-policy will be created
  + resource "aws_iam_policy" "throwtrash-alarm-lambda-policy" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "throwtrash-alarm-lambda-policy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags        = {
          + "app"   = "throwtrash"
          + "group" = "alarm"
        }
      + tags_all    = {
          + "app"   = "throwtrash"
          + "group" = "alarm"
        }
    }

  # module.api.aws_iam_policy.throwtrash-alarm-scheduler-policy will be created
  + resource "aws_iam_policy" "throwtrash-alarm-scheduler-policy" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "throwtrash-alarm-scheduler-policy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags        = {
          + "app"   = "throwtrash"
          + "group" = "alarm"
        }
      + tags_all    = {
          + "app"   = "throwtrash"
          + "group" = "alarm"
        }
    }

  # module.api.aws_iam_role.throwtrash-alarm-lambda-role will be created
  + resource "aws_iam_role" "throwtrash-alarm-lambda-role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "throwtrash-alarm-lambda-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "app"   = "throwtrash"
          + "group" = "alarm"
        }
      + tags_all              = {
          + "app"   = "throwtrash"
          + "group" = "alarm"
        }
      + unique_id             = (known after apply)
    }

  # module.api.aws_iam_role.throwtrash-alarm-scheduler-role will be created
  + resource "aws_iam_role" "throwtrash-alarm-scheduler-role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "scheduler.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "throwtrash-alarm-scheduler-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "app"   = "throwtrash"
          + "group" = "alarm"
        }
      + tags_all              = {
          + "app"   = "throwtrash"
          + "group" = "alarm"
        }
      + unique_id             = (known after apply)
    }

  # module.api.aws_iam_role_policy_attachment.lambda-policy-attachment will be created
  + resource "aws_iam_role_policy_attachment" "lambda-policy-attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "throwtrash-alarm-lambda-role"
    }

  # module.api.aws_iam_role_policy_attachment.scheduler-policy-attachment will be created
  + resource "aws_iam_role_policy_attachment" "scheduler-policy-attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "throwtrash-alarm-scheduler-role"
    }

  # module.api.aws_lambda_alias.throwtrash-create-dev will be created
  + resource "aws_lambda_alias" "throwtrash-create-dev" {
      + arn              = (known after apply)
      + function_name    = "throwtrash-alarm-create"
      + function_version = "$LATEST"
      + id               = (known after apply)
      + invoke_arn       = (known after apply)
      + name             = "dev"
    }

  # module.api.aws_lambda_alias.throwtrash-delete-dev will be created
  + resource "aws_lambda_alias" "throwtrash-delete-dev" {
      + arn              = (known after apply)
      + function_name    = "throwtrash-alarm-delete"
      + function_version = "$LATEST"
      + id               = (known after apply)
      + invoke_arn       = (known after apply)
      + name             = "dev"
    }

  # module.api.aws_lambda_alias.throwtrash-update-dev will be created
  + resource "aws_lambda_alias" "throwtrash-update-dev" {
      + arn              = (known after apply)
      + function_name    = "throwtrash-alarm-update"
      + function_version = "$LATEST"
      + id               = (known after apply)
      + invoke_arn       = (known after apply)
      + name             = "dev"
    }

  # module.api.aws_lambda_function.throwtrash-alarm-create-lambda will be created
  + resource "aws_lambda_function" "throwtrash-alarm-create-lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "api/app-create.zip"
      + function_name                  = "throwtrash-alarm-create"
      + handler                        = "index.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs20.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "6S1xCFflZAbYLK8IYaFAlSincX7488+f2r5u6GRGKX4="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "app"   = "throwtrash"
          + "group" = "alarm"
        }
      + tags_all                       = {
          + "app"   = "throwtrash"
          + "group" = "alarm"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + logging_config {
          + log_format = "JSON"
          + log_group  = "/aws/lambda/throwtrash-alarm"
        }
    }

  # module.api.aws_lambda_function.throwtrash-alarm-delete-lambda will be created
  + resource "aws_lambda_function" "throwtrash-alarm-delete-lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "api/app-delete.zip"
      + function_name                  = "throwtrash-alarm-delete"
      + handler                        = "index.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs20.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "ouL/KT5Xsfy36xx4UAEHMaG9VDiAdO16qvtZMCAb4S4="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "app"   = "throwtrash"
          + "group" = "alarm"
        }
      + tags_all                       = {
          + "app"   = "throwtrash"
          + "group" = "alarm"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "ALARM_TABLE_NAME" = "throwtrash-alarm"
            }
        }

      + logging_config {
          + log_format = "JSON"
          + log_group  = "/aws/lambda/throwtrash-alarm"
        }
    }

  # module.api.aws_lambda_function.throwtrash-alarm-update-lambda will be created
  + resource "aws_lambda_function" "throwtrash-alarm-update-lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "api/app-update.zip"
      + function_name                  = "throwtrash-alarm-update"
      + handler                        = "index.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs20.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "MtD/zcN+J6rIs81CuJP+8WIYu/vUwcEsMM9LwpgntJU="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "app"   = "throwtrash"
          + "group" = "alarm"
        }
      + tags_all                       = {
          + "app"   = "throwtrash"
          + "group" = "alarm"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + logging_config {
          + log_format = "JSON"
          + log_group  = "/aws/lambda/throwtrash-alarm"
        }
    }

  # module.api.aws_lambda_permission.throwtrash-create-permission-apigw will be created
  + resource "aws_lambda_permission" "throwtrash-create-permission-apigw" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "throwtrash-alarm-create"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + qualifier           = "dev"
      + source_arn          = (known after apply)
      + statement_id        = (known after apply)
      + statement_id_prefix = (known after apply)
    }

  # module.api.aws_lambda_permission.throwtrash-delete-permission-apigw will be created
  + resource "aws_lambda_permission" "throwtrash-delete-permission-apigw" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "throwtrash-alarm-delete"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + qualifier           = "dev"
      + source_arn          = (known after apply)
      + statement_id        = (known after apply)
      + statement_id_prefix = (known after apply)
    }

  # module.api.aws_lambda_permission.throwtrash-update-permission-apigw will be created
  + resource "aws_lambda_permission" "throwtrash-update-permission-apigw" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "throwtrash-alarm-update"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + qualifier           = "dev"
      + source_arn          = (known after apply)
      + statement_id        = (known after apply)
      + statement_id_prefix = (known after apply)
    }

  # module.api.aws_scheduler_schedule_group.throwtrash-alarm-schedule-group will be created
  + resource "aws_scheduler_schedule_group" "throwtrash-alarm-schedule-group" {
      + arn                    = (known after apply)
      + creation_date          = (known after apply)
      + id                     = (known after apply)
      + last_modification_date = (known after apply)
      + name                   = "throwtrash-alarm-schedule-group"
      + name_prefix            = (known after apply)
      + state                  = (known after apply)
      + tags                   = {
          + "app"   = "throwtrash"
          + "group" = "alarm"
        }
      + tags_all               = {
          + "app"   = "throwtrash"
          + "group" = "alarm"
        }
    }

  # module.layer.aws_lambda_layer_version.layer will be created
  + resource "aws_lambda_layer_version" "layer" {
      + arn                         = (known after apply)
      + compatible_runtimes         = [
          + "nodejs20.x",
        ]
      + created_date                = (known after apply)
      + filename                    = "shared/layer.zip"
      + id                          = (known after apply)
      + layer_arn                   = (known after apply)
      + layer_name                  = "throwtrash-alarm-libs"
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + skip_destroy                = true
      + source_code_hash            = "cC5aoqf2kEIorOW26ZfnnMCSZpMLgenDBFwN0x8maWU="
      + source_code_size            = (known after apply)
      + version                     = (known after apply)
    }

Plan: 40 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.```